- fillna
- fillna col
- bfill
- backfill
- ffill
- pad

- mean,median,mode
- sklearn --- impute method --- knnimputerpad

In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

In [2]:
dict1={"name":["aravind","samar",np.nan,"siri"],"age":[np.nan,21,32,43],"city":["hyd","blr","chennai",np.nan]}

In [3]:
d1=pd.DataFrame(dict1)
d1

      name   age     city
0  aravind   NaN      hyd
1    samar  21.0      blr
2      NaN  32.0  chennai
3     siri  43.0      NaN

In [4]:
d1.dtypes

name     object
age     float64
city     object
dtype: object

In [5]:
d1.isna().sum()

name    1
age     1
city    1
dtype: int64

In [6]:
dict1={"name":["aravind","samar",None,"siri"],"age":[None,21,32,43],"city":["hyd","blr","chennai",None]}

In [7]:
d1=pd.DataFrame(dict1)
d1

      name   age     city
0  aravind   NaN      hyd
1    samar  21.0      blr
2     None  32.0  chennai
3     siri  43.0     None

In [8]:
d1.dtypes

name     object
age     float64
city     object
dtype: object

In [9]:
d1.isna().sum()

name    1
age     1
city    1
dtype: int64

- nan (not number)is not a number-applicable for columns only

- when data has empty rows
  - it is data problem
  - if you read that kind of data you will see null
  - need to understand that data is currupted or really null value

In [10]:
d1.isna().sum()/len(d1)*100

name    25.0
age     25.0
city    25.0
dtype: float64

__method-1__

- fill with random value
  - fillna()

In [36]:
d1.fillna(40)

      name   age     city
0  aravind  40.0      hyd
1    samar  21.0      blr
2       40  32.0  chennai
3     siri  43.0       40

__method-2__

- fill wrt to col

In [39]:
d1["age"].fillna(40)

0    40.0
1    21.0
2    32.0
3    43.0
Name: age, dtype: float64

In [40]:
d1

      name   age     city
0  aravind   NaN      hyd
1    samar  21.0      blr
2      NaN  32.0  chennai
3     siri  43.0      NaN

In [42]:
d1["age"].fillna(40,inplace=True)
d1

      name   age     city
0  aravind  40.0      hyd
1    samar  21.0      blr
2      NaN  32.0  chennai
3     siri  43.0      NaN

In [43]:
d1["name"].fillna("raj",inplace=True)
d1

      name   age     city
0  aravind  40.0      hyd
1    samar  21.0      blr
2      raj  32.0  chennai
3     siri  43.0      NaN

In [45]:
dict1={"name":["aravind","samar",None,"siri"],"age":[None,21,32,43],"city":["hyd","blr","chennai",None]}
d1=pd.DataFrame(dict1)
d1

      name   age     city
0  aravind   NaN      hyd
1    samar  21.0      blr
2     None  32.0  chennai
3     siri  43.0     None

__method-3__

- bfill (taking next value)
- backfill
- ffill
- pad

In [57]:
dict1={"name":["aravind","samar",None,"siri"],"age":[None,21,32,43],"city":["hyd","blr","chennai",None]}
d1=pd.DataFrame(dict1)
d1

      name   age     city
0  aravind   NaN      hyd
1    samar  21.0      blr
2     None  32.0  chennai
3     siri  43.0     None

In [56]:
d1.fillna(method="bfill")

C:\Users\Rajasri\AppData\Local\Temp\ipykernel_21328\2947328357.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  d1.fillna(method="bfill")

      name   age     city
0  aravind  21.0      hyd
1    samar  21.0      blr
2     siri  32.0  chennai
3     siri  43.0     None

In [58]:
d1.fillna(method="bfill",axis=1)

C:\Users\Rajasri\AppData\Local\Temp\ipykernel_21328\271113676.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  d1.fillna(method="bfill",axis=1)

      name   age     city
0  aravind   hyd      hyd
1    samar  21.0      blr
2     32.0  32.0  chennai
3     siri  43.0     None

In [47]:
dict1={"name":["aravind","samar",None,"siri"],"age":[None,21,32,43],"city":["hyd","blr","chennai",None]}
d1=pd.DataFrame(dict1)
d1

      name   age     city
0  aravind   NaN      hyd
1    samar  21.0      blr
2     None  32.0  chennai
3     siri  43.0     None

In [48]:
d1.fillna(method="backfill")

C:\Users\Rajasri\AppData\Local\Temp\ipykernel_21328\3993376519.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  d1.fillna(method="backfill")

      name   age     city
0  aravind  21.0      hyd
1    samar  21.0      blr
2     siri  32.0  chennai
3     siri  43.0     None

In [49]:
dict1={"name":["aravind","samar",None,"siri"],"age":[None,21,32,43],"city":["hyd","blr","chennai",None]}
d1=pd.DataFrame(dict1)
d1

      name   age     city
0  aravind   NaN      hyd
1    samar  21.0      blr
2     None  32.0  chennai
3     siri  43.0     None

In [50]:
d1.fillna(method="ffill")

C:\Users\Rajasri\AppData\Local\Temp\ipykernel_21328\4243749665.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  d1.fillna(method="ffill")

      name   age     city
0  aravind   NaN      hyd
1    samar  21.0      blr
2    samar  32.0  chennai
3     siri  43.0  chennai

In [53]:
dict1={"name":["aravind","samar",None,"siri"],"age":[None,21,32,43],"city":["hyd","blr","chennai",None]}
d1=pd.DataFrame(dict1)
d1

      name   age     city
0  aravind   NaN      hyd
1    samar  21.0      blr
2     None  32.0  chennai
3     siri  43.0     None

In [54]:
d1.fillna(method="pad")

C:\Users\Rajasri\AppData\Local\Temp\ipykernel_21328\1472097110.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  d1.fillna(method="pad")

      name   age     city
0  aravind   NaN      hyd
1    samar  21.0      blr
2    samar  32.0  chennai
3     siri  43.0  chennai

- backfill, bfill same
- pad,ffill same
- change based on axis

__method-4__

- mean
- median
- mode

- numerical values can fill
  - mean
    - best if no outlier
  - median
    - use if outlier
- categorical values can fill
  - mode

In [2]:
dict1={"name":["aravind","samar",None,"siri"],"age":[None,21,32,43],"city":["hyd","blr","chennai",None]}
d1=pd.DataFrame(dict1)
d1

      name   age     city
0  aravind   NaN      hyd
1    samar  21.0      blr
2     None  32.0  chennai
3     siri  43.0     None

In [3]:
meann=np.mean(d1["age"])
d1["age"].fillna(meann)

0    32.0
1    21.0
2    32.0
3    43.0
Name: age, dtype: float64

In [4]:
mediann=(d1["age"]).median()
d1["age"].fillna(mediann)

0    32.0
1    21.0
2    32.0
3    43.0
Name: age, dtype: float64

In [7]:
mediann=np.median(d1["age"])
d1["age"].fillna(mediann)
np.median(d1["age"])

nan

In [9]:
modee=d1["city"].mode()
d1["city"].fillna(modee)
# not getting
# in real time will get clear mode val

0        hyd
1        blr
2    chennai
3        NaN
Name: city, dtype: object

__method-5__

- KNN imputer

- only for numerical values

- knn = k nearest neighbours
- k is a hyper parameter, user can choose
- it is distance metric = euclean distance
- mean of neighbour values
- neighbour value can provided by using value =k

- sklearn --- impute method --- knnimputer

In [15]:
from sklearn.impute import KNNImputer
kn=KNNImputer()
kn.fit_transform(d1[["age"]])

array([[32.],
       [21.],
       [32.],
       [43.]])

- both ffill, bfill

In [28]:
dict1={"name":["aravind","samar",np.nan,"siri"],"age":[np.nan,21,32,43],"city":["hyd","blr","chennai",np.nan]}
d1=pd.DataFrame(dict1)
d1

      name   age     city
0  aravind   NaN      hyd
1    samar  21.0      blr
2      NaN  32.0  chennai
3     siri  43.0      NaN

In [29]:
d1.isna().sum().sum()

3

In [30]:
if d1.isna().sum().sum():
    x=d1.ffill().bfill()
else:
    print("a")

In [31]:
x

      name   age     city
0  aravind  21.0      hyd
1    samar  21.0      blr
2    samar  32.0  chennai
3     siri  43.0  chennai